GopalSaraf/Practicals/PSDL/include/proc/pic16f15355.inc
#define RC3PPS1                          BANKMASK(RC3PPS), 1
#define RC3PPS2                          BANKMASK(RC3PPS), 2
#define RC3PPS3                          BANKMASK(RC3PPS), 3
#define RC3PPS4                          BANKMASK(RC3PPS), 4
#define RC4                              BANKMASK(PORTC), 4
#define RC4PPS0                          BANKMASK(RC4PPS), 0
#define RC4PPS1                          BANKMASK(RC4PPS), 1
#define RC4PPS2                          BANKMASK(RC4PPS), 2
#define RC4PPS3                          BANKMASK(RC4PPS), 3
#define RC4PPS4                          BANKMASK(RC4PPS), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC5PPS0                          BANKMASK(RC5PPS), 0
#define RC5PPS1                          BANKMASK(RC5PPS), 1
#define RC5PPS2                          BANKMASK(RC5PPS), 2
#define RC5PPS3                          BANKMASK(RC5PPS), 3
#define RC5PPS4                          BANKMASK(RC5PPS), 4
#define RC6                              BANKMASK(PORTC), 6
#define RC6PPS0                          BANKMASK(RC6PPS), 0
#define RC6PPS1                          BANKMASK(RC6PPS), 1
#define RC6PPS2                          BANKMASK(RC6PPS), 2
#define RC6PPS3                          BANKMASK(RC6PPS), 3
#define RC6PPS4                          BANKMASK(RC6PPS), 4
#define RC7                              BANKMASK(PORTC), 7
#define RC7PPS0                          BANKMASK(RC7PPS), 0
#define RC7PPS1                          BANKMASK(RC7PPS), 1
#define RC7PPS2                          BANKMASK(RC7PPS), 2
#define RC7PPS3                          BANKMASK(RC7PPS), 3
#define RC7PPS4                          BANKMASK(RC7PPS), 4
#define RCEN1                            BANKMASK(SSP1CON2), 3
#define RCEN2                            BANKMASK(SSP2CON2), 3
#define RD                               BANKMASK(NVMCON1), 0
#define RD16                             BANKMASK(T1CON), 1
#define RD161                            BANKMASK(T1CON), 1
#define RE3                              BANKMASK(PORTE), 3
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define REN                              BANKMASK(CWG1AS0), 6
#define ROI                              BANKMASK(CPUDOZE), 5
#define RSEL0                            BANKMASK(T2RST), 0
#define RSEL1                            BANKMASK(T2RST), 1
#define RSEL2                            BANKMASK(T2RST), 2
#define RSEL3                            BANKMASK(T2RST), 3
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define RX1DTPPS0                        BANKMASK(RX1DTPPS), 0
#define RX1DTPPS1                        BANKMASK(RX1DTPPS), 1
#define RX1DTPPS2                        BANKMASK(RX1DTPPS), 2
#define RX1DTPPS3                        BANKMASK(RX1DTPPS), 3
#define RX1DTPPS4                        BANKMASK(RX1DTPPS), 4
#define RX1DTPPS5                        BANKMASK(RX1DTPPS), 5
#define RX2DTPPS0                        BANKMASK(RX2DTPPS), 0
#define RX2DTPPS1                        BANKMASK(RX2DTPPS), 1
#define RX2DTPPS2                        BANKMASK(RX2DTPPS), 2
#define RX2DTPPS3                        BANKMASK(RX2DTPPS), 3
#define RX2DTPPS4                        BANKMASK(RX2DTPPS), 4
#define RX2DTPPS5                        BANKMASK(RX2DTPPS), 5
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1CLKPPS5                      BANKMASK(SSP1CLKPPS), 5
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1DATPPS5                      BANKMASK(SSP1DATPPS), 5
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP1SSPPS5                       BANKMASK(SSP1SSPPS), 5
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4
#define SSP2CLKPPS5                      BANKMASK(SSP2CLKPPS), 5
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4
#define SSP2DATPPS5                      BANKMASK(SSP2DATPPS), 5
#define SSP2IE                           BANKMASK(PIE3), 2
#define SSP2IF                           BANKMASK(PIR3), 2
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4
#define SSP2SSPPS5                       BANKMASK(SSP2SSPPS), 5
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define STRA                             BANKMASK(CWG1STR), 0
#define STRB                             BANKMASK(CWG1STR), 1
#define STRC                             BANKMASK(CWG1STR), 2
#define STRD                             BANKMASK(CWG1STR), 3
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T0PS0                            BANKMASK(T0CON1), 0
#define T0PS1                            BANKMASK(T0CON1), 1
#define T0PS2                            BANKMASK(T0CON1), 2
#define T0PS3                            BANKMASK(T0CON1), 3
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GPPS5                          BANKMASK(T1GPPS), 5
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPOL                          BANKMASK(T2HLT), 6
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CKSYNC                         BANKMASK(T2HLT), 5
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2INPPS5                         BANKMASK(T2INPPS), 5
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD1), 0
#define TMR10                            BANKMASK(TMR1L), 0
#define TMR11                            BANKMASK(TMR1L), 1
#define TMR110                           BANKMASK(TMR1H), 2
#define TMR111                           BANKMASK(TMR1H), 3
#define TMR112                           BANKMASK(TMR1H), 4
#define TMR113                           BANKMASK(TMR1H), 5
#define TMR114                           BANKMASK(TMR1H), 6
#define TMR115                           BANKMASK(TMR1H), 7
#define TMR12                            BANKMASK(TMR1L), 2
#define TMR13                            BANKMASK(TMR1L), 3
#define TMR14                            BANKMASK(TMR1L), 4
#define TMR15                            BANKMASK(TMR1L), 5
#define TMR16                            BANKMASK(TMR1L), 6
#define TMR17                            BANKMASK(TMR1L), 7
#define TMR18                            BANKMASK(TMR1H), 0
#define TMR19                            BANKMASK(TMR1H), 1
#define TMR1GIE                          BANKMASK(PIE5), 0
#define TMR1GIF                          BANKMASK(PIR5), 0
#define TMR1H0                           BANKMASK(TMR1H), 0
#define TMR1H1                           BANKMASK(TMR1H), 1
#define TMR1H2                           BANKMASK(TMR1H), 2
#define TMR1H3                           BANKMASK(TMR1H), 3
#define TMR1H4                           BANKMASK(TMR1H), 4
#define TMR1H5                           BANKMASK(TMR1H), 5
#define TMR1H6                           BANKMASK(TMR1H), 6
#define TMR1H7                           BANKMASK(TMR1H), 7
#define TMR1IE                           BANKMASK(PIE4), 0
#define TMR1IF                           BANKMASK(PIR4), 0
#define TMR1L0                           BANKMASK(TMR1L), 0
#define TMR1L1                           BANKMASK(TMR1L), 1
#define TMR1L2                           BANKMASK(TMR1L), 2
#define TMR1L3                           BANKMASK(TMR1L), 3
#define TMR1L4                           BANKMASK(TMR1L), 4
#define TMR1L5                           BANKMASK(TMR1L), 5
#define TMR1L6                           BANKMASK(TMR1L), 6
#define TMR1L7                           BANKMASK(TMR1L), 7
#define TMR1MD                           BANKMASK(PMD1), 1
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE4), 1
#define TMR2IF                           BANKMASK(PIR4), 1
#define TMR2MD                           BANKMASK(PMD1), 2
#define TMR2ON                           BANKMASK(T2CON), 7
#define TOSH0                            BANKMASK(TOSH), 0
#define TOSH1                            BANKMASK(TOSH), 1
#define TOSH2                            BANKMASK(TOSH), 2
#define TOSH3                            BANKMASK(TOSH), 3
#define TOSH4                            BANKMASK(TOSH), 4
#define TOSH5                            BANKMASK(TOSH), 5
#define TOSH6                            BANKMASK(TOSH), 6
#define TOSH7                            BANKMASK(TOSH), 7
#define TOSL0                            BANKMASK(TOSL), 0
#define TOSL1                            BANKMASK(TOSL), 1
#define TOSL2                            BANKMASK(TOSL), 2
#define TOSL3                            BANKMASK(TOSL), 3
#define TOSL4                            BANKMASK(TOSL), 4
#define TOSL5                            BANKMASK(TOSL), 5
#define TOSL6                            BANKMASK(TOSL), 6
#define TOSL7                            BANKMASK(TOSL), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISE3                           BANKMASK(TRISE), 3
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TX1CKPPS0                        BANKMASK(TX1CKPPS), 0
#define TX1CKPPS1                        BANKMASK(TX1CKPPS), 1
#define TX1CKPPS2                        BANKMASK(TX1CKPPS), 2
#define TX1CKPPS3                        BANKMASK(TX1CKPPS), 3
#define TX1CKPPS4                        BANKMASK(TX1CKPPS), 4
#define TX1CKPPS5                        BANKMASK(TX1CKPPS), 5
#define TX1IE                            BANKMASK(PIE3), 4
#define TX1IF                            BANKMASK(PIR3), 4
#define TX2CKPPS0                        BANKMASK(TX2CKPPS), 0
#define TX2CKPPS1                        BANKMASK(TX2CKPPS), 1
#define TX2CKPPS2                        BANKMASK(TX2CKPPS), 2
#define TX2CKPPS3                        BANKMASK(TX2CKPPS), 3
#define TX2CKPPS4                        BANKMASK(TX2CKPPS), 4
#define TX2CKPPS5                        BANKMASK(TX2CKPPS), 5
#define TX2IE                            BANKMASK(PIE3), 6
#define TX2IF                            BANKMASK(PIR3), 6
#define UA1                              BANKMASK(SSP1STAT), 1
#define UA2                              BANKMASK(SSP2STAT), 1
#define UART1MD                          BANKMASK(PMD4), 6
#define UART2MD                          BANKMASK(PMD4), 7
#define VREGPM                           BANKMASK(VREGCON), 1
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WCOL2                            BANKMASK(SSP2CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
